loadTest/microTest.yml
config:
  target: "http://127.0.0.1:3003"
  http:
    timeout: 2
    pool: 10
  phases: 
    - duration: 60
      arrivalRate: 5
      rampTo: 30
      name: "Warm up phase"
    - duration: 300
      arrivalRate: 30
      name: "Sustained Max Load"
  processor: "./loadTestHelpers.js"
scenarios:
  - flow:
    - loop:
      - get:
          url: "/api/restaurants/{{ id }}/businessinfo"
          beforeRequest: "getRandomNormalId"
      count: 100
    weight: 1
  - flow:
    - loop:
      - get:
          url: "/api/restaurants/{{ id }}/businessinfo"
          beforeRequest: "getRandomPopularId"
      count: 100
    weight: 1